# a. Просим пользователя ввести число от 1 до 9
x = int(input("Введите число от 1 до 9: "))

# b. Если число от 1 до 3
if 1 <= x <= 3:
    s = input("Введите строку: ")
    n = int(input("Введите число повторов строки: "))
    for i in range(n):
        print(s)

# c. Если число от 4 до 6
elif 4 <= x <= 6:
    m = int(input("Введите степень, в которую нужно возвести число: "))
    result = x ** m
    print(f"{x} в степени {m} = {result}")

# d. Если число от 7 до 9
elif 7 <= x <= 9:
    for i in range(10):
        print(x)
        x += 1

# e. Во всех остальных случаях
else:
    print("Ошибка ввода")