text1 = "Стиль \
Стиль — это всё \
Это свежий взгляд на скучное и опасное \
Стильное, но скучное лучше, чем опасное, но не стильное \
Опасное и стильное — это искусство \
Бой быков может быть искусством \
Бокс может быть искусством \
Любовь тоже искусство \
Открываем банку сардин — и это искусство \
Стиль есть не у всех \
Не все ему верны \
В собаках может быть больше стиля, чем в людях \
Но не у всех собак есть стиль \
Кошки безмерно стильные \
Когда Хемингуэй выстрелом размазал свои мозги по стене — это было стильно \
Люди тоже диктуют стиль \
Жанна дАрк была стильной \
Иоанн Креститель, Иисус, Сократ, Цезарь, Гарсия Лорка \
Я встречал стильных зеков \
В тюрьме больше стильных людей, чем на свободе \
Стиль — это свойство, манера, устройство \
Шесть цапель будут спокойно стоять в пруду \
А вы голышом выйдете из ванной, не заметив меня"

text2="Люди в первую очередь хотят внимания к себе. Стиль тут средство, а не цель. \
Желание, чтобы вас выделяли среди других, чтобы ждали именно ваших текстов, это, ну, \
нормальное человеческое желание. Профсоюз замшелых школьных училок с этим не согласится, \
но я бы не стал ориентироваться на их life choices.\
Эго вещь важная, с его желаниями надо считаться. Хочется — запритесь в пещере, и думать забудьте \
про всяких людей. Хочется — вкладывайте усилия в текст, чтобы заработать чужое внимание. \
Обманывать себя не надо только, осознайте и сформулируйте, ради чего стараетесь. Это упрощает жизнь. \
Хорошая новость: чтобы нравиться и выделяться, автору необязательно выполнять огромный квест «построй свой стиль». Незачем палить по воробьям ядерными ракетами. \
Определите, для кого вы хотите писать и почему. \
Пишите понятно и будьте полезны читателям. Или пишите понятно и достаточно увлекательно, чтоб их развлечь. \
Полезные / увлекательные тексты, опубликованные в подходящих местах, уже соберут читателей вокруг вас. Даже без узнаваемого «стиля». \
Я не говорю, что писать понятно, содержательно и интересно — простая задача. Нет, этому тоже учатся, порой учатся долго. Однако ж, добавляя стилевые запросы, мы превращаем долго в ДОООЛГО."

def make_dict(text):
  split_text = text.split()
  trash_simbols = "-—,?.:;"


  lower_words=[]
  for i in split_text:
    if i not in trash_simbols:
      lower_words.append(i.lower())

  count={}

  for word in lower_words:
    count[word] = count.get(word, 0) + 1
  return count


dict1=make_dict(text1)
dict2=make_dict(text2)

common_words=set(dict1.keys()) & set(dict2.keys())
print(f"Слова, которые встречаются в 2-х текстах: {common_words}")

common={}
for i in dict1:
  if i in common_words:
    common[i] = dict1[i]+dict2[i]

pairs=[]
for i in common:
  pairs.append((common[i], i))

pairs.sort(reverse=True)

sorted_common = {}
for freq, word in pairs:
  sorted_common[word] = freq
print(f"Отсортированные: {sorted_common}")

for i in list(sorted_common.keys()):
  if len(i) < 3:
    del sorted_common[i]
print(f"Больше 3-х слов: {sorted_common}")